In [1]:
#import dependencies

import pandas as pd
from sqlalchemy import create_engine
import config
from sqlalchemy import inspect
from sqlalchemy import text

In [2]:
#read in players csv file 

players_path = "Resources/players.csv"
players_csv = pd.read_csv(players_path)
players_csv.head()

,_id,birthDate,birthPlace,career_AST,career_FG%,career_FG3%,career_FT%,career_G,career_PER,career_PTS,...,draft_pick,draft_round,draft_team,draft_year,height,highSchool,name,position,shoots,weight
0,abdelal01,"June 24, 1968","Cairo, Egypt",0.3,50.2,0.0,70.1,256,13.0,5.7,...,25th overall,1st round,Portland Trail Blazers,1990,6-10,"Bloomfield in Bloomfield, New Jersey",Alaa Abdelnaby,Power Forward,Right,240lb
1,abdulza01,"April 7, 1946","Brooklyn, New York",1.2,42.8,NaN,72.8,505,15.1,9.0,...,5th overall,1st round,Cincinnati Royals,1968,6-9,"John Jay in Brooklyn, New York",Zaid Abdul-Aziz,Power Forward and Center,Right,235lb
2,abdulka01,"April 16, 1947","New York, New York",3.6,55.9,5.6,72.1,1560,24.6,24.6,...,1st overall,1st round,Milwaukee Bucks,1969,7-2,"Power Memorial in New York, New York",Kareem Abdul-Jabbar,Center,Right,225lb
3,abdulma02,"March 9, 1969","Gulfport, Mississippi",3.5,44.2,35.4,90.5,586,15.4,14.6,...,3rd overall,1st round,Denver Nuggets,1990,6-1,"Gulfport in Gulfport, Mississippi",Mahmoud Abdul-Rauf,Point Guard,Right,162lb
4,abdulta01,"November 3, 1974","Maisons Alfort, France",1.1,41.7,23.7,70.3,236,11.4,7.8,...,11th overall,1st round,Sacramento Kings,1997,6-6,"Lycee Aristide Briand in Evreux, France",Tariq Abdul-Wahad,Shooting Guard,Right,223lb

# Demographics Table

In [3]:
#pulled the columns for the demographics table

demographics = players_csv[['_id', 'name', 'height', 'weight', 'birthDate', 'birthPlace']]
demographics.head()

,_id,name,height,weight,birthDate,birthPlace
0,abdelal01,Alaa Abdelnaby,6-10,240lb,"June 24, 1968","Cairo, Egypt"
1,abdulza01,Zaid Abdul-Aziz,6-9,235lb,"April 7, 1946","Brooklyn, New York"
2,abdulka01,Kareem Abdul-Jabbar,7-2,225lb,"April 16, 1947","New York, New York"
3,abdulma02,Mahmoud Abdul-Rauf,6-1,162lb,"March 9, 1969","Gulfport, Mississippi"
4,abdulta01,Tariq Abdul-Wahad,6-6,223lb,"November 3, 1974","Maisons Alfort, France"

In [4]:
#removed the lb from the weight
weight = demographics["weight"].str.split("l", n = 1, expand = True)
weight.head()

     0  1
0  240  b
1  235  b
2  225  b
3  162  b
4  223  b

In [5]:
#added weight column to db

demographics["weight"] = weight[0]
demographics.head()

<ipython-input-5-ee85200d6922>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  demographics["weight"] = weight[0]

,_id,name,height,weight,birthDate,birthPlace
0,abdelal01,Alaa Abdelnaby,6-10,240,"June 24, 1968","Cairo, Egypt"
1,abdulza01,Zaid Abdul-Aziz,6-9,235,"April 7, 1946","Brooklyn, New York"
2,abdulka01,Kareem Abdul-Jabbar,7-2,225,"April 16, 1947","New York, New York"
3,abdulma02,Mahmoud Abdul-Rauf,6-1,162,"March 9, 1969","Gulfport, Mississippi"
4,abdulta01,Tariq Abdul-Wahad,6-6,223,"November 3, 1974","Maisons Alfort, France"

In [6]:
#extracted borth year from birthdate

birth_year = demographics["birthDate"].str.split(" ", n = 2, expand = True)
birth_year.head()

          0    1     2
0      June  24,  1968
1     April   7,  1946
2     April  16,  1947
3     March   9,  1969
4  November   3,  1974

In [7]:
#added birthyear back to the db

demographics["birth_year"] = birth_year[2]

<ipython-input-7-f4299c54aee0>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  demographics["birth_year"] = birth_year[2]

In [8]:
#split birth city and state/country

birth_city = demographics["birthPlace"].str.split(", ", n = 1, expand = True)
birth_city.head()

                0            1
0           Cairo        Egypt
1        Brooklyn     New York
2        New York     New York
3        Gulfport  Mississippi
4  Maisons Alfort       France

In [9]:
#added birth city and birth state/country back to db

demographics["birth_city"] = birth_city[0]
demographics["birth_state"] = birth_city[1]
demographics.head()

<ipython-input-9-2b147add6341>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  demographics["birth_city"] = birth_city[0]
<ipython-input-9-2b147add6341>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  demographics["birth_state"] = birth_city[1]

,_id,name,height,weight,birthDate,birthPlace,birth_year,birth_city,birth_state
0,abdelal01,Alaa Abdelnaby,6-10,240,"June 24, 1968","Cairo, Egypt",1968,Cairo,Egypt
1,abdulza01,Zaid Abdul-Aziz,6-9,235,"April 7, 1946","Brooklyn, New York",1946,Brooklyn,New York
2,abdulka01,Kareem Abdul-Jabbar,7-2,225,"April 16, 1947","New York, New York",1947,New York,New York
3,abdulma02,Mahmoud Abdul-Rauf,6-1,162,"March 9, 1969","Gulfport, Mississippi",1969,Gulfport,Mississippi
4,abdulta01,Tariq Abdul-Wahad,6-6,223,"November 3, 1974","Maisons Alfort, France",1974,Maisons Alfort,France

In [10]:
#split height into feet and inches so we could get the total height in inches 

height = demographics["height"].str.split("-", n = 1, expand = True)
height.head()

   0   1
0  6  10
1  6   9
2  7   2
3  6   1
4  6   6

In [11]:
#converted height to int

height = height.astype("int64")
height[0].dtype

dtype('int64')

In [12]:
#multiplied feet by 12 to converto to inches

height['feet'] = (height[0])*12
height

      0   1  feet
0     6  10    72
1     6   9    72
2     7   2    84
3     6   1    72
4     6   6    72
...  ..  ..   ...
4680  6  11    72
4681  7   1    84
4682  6   1    72
4683  7   1    84
4684  6   3    72

[4685 rows x 3 columns]

In [13]:
#added the inches column to the new 'feet'column and saved the total in a new column called height

height['height'] = height['feet'] + height[1]
height

      0   1  feet  height
0     6  10    72      82
1     6   9    72      81
2     7   2    84      86
3     6   1    72      73
4     6   6    72      78
...  ..  ..   ...     ...
4680  6  11    72      83
4681  7   1    84      85
4682  6   1    72      73
4683  7   1    84      85
4684  6   3    72      75

[4685 rows x 4 columns]

In [14]:
#added hew height column to db

demographics['height'] = height['height']
demographics.head()

<ipython-input-14-e24220797cc5>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  demographics['height'] = height['height']

,_id,name,height,weight,birthDate,birthPlace,birth_year,birth_city,birth_state
0,abdelal01,Alaa Abdelnaby,82,240,"June 24, 1968","Cairo, Egypt",1968,Cairo,Egypt
1,abdulza01,Zaid Abdul-Aziz,81,235,"April 7, 1946","Brooklyn, New York",1946,Brooklyn,New York
2,abdulka01,Kareem Abdul-Jabbar,86,225,"April 16, 1947","New York, New York",1947,New York,New York
3,abdulma02,Mahmoud Abdul-Rauf,73,162,"March 9, 1969","Gulfport, Mississippi",1969,Gulfport,Mississippi
4,abdulta01,Tariq Abdul-Wahad,78,223,"November 3, 1974","Maisons Alfort, France",1974,Maisons Alfort,France

In [15]:
#removed unwanted columns

demographics = demographics[["_id", "name", "height", "weight", "birth_year", "birth_city", "birth_state"]]
demographics.head()

,_id,name,height,weight,birth_year,birth_city,birth_state
0,abdelal01,Alaa Abdelnaby,82,240,1968,Cairo,Egypt
1,abdulza01,Zaid Abdul-Aziz,81,235,1946,Brooklyn,New York
2,abdulka01,Kareem Abdul-Jabbar,86,225,1947,New York,New York
3,abdulma02,Mahmoud Abdul-Rauf,73,162,1969,Gulfport,Mississippi
4,abdulta01,Tariq Abdul-Wahad,78,223,1974,Maisons Alfort,France

In [16]:
#renamed player id column

demographics = demographics.rename(columns={"_id": "player_id"})

In [17]:
#removed rows with missing values

demographics.dropna(inplace=True)
demographics.head()

,player_id,name,height,weight,birth_year,birth_city,birth_state
0,abdelal01,Alaa Abdelnaby,82,240,1968,Cairo,Egypt
1,abdulza01,Zaid Abdul-Aziz,81,235,1946,Brooklyn,New York
2,abdulka01,Kareem Abdul-Jabbar,86,225,1947,New York,New York
3,abdulma02,Mahmoud Abdul-Rauf,73,162,1969,Gulfport,Mississippi
4,abdulta01,Tariq Abdul-Wahad,78,223,1974,Maisons Alfort,France

# Salary Table

In [18]:
#read in salary data

salary_path = "Resources/salaries_1985to2018.csv"
salary = pd.read_csv(salary_path)
salary.head()

,league,player_id,salary,season,season_end,season_start,team
0,NBA,abdelal01,395000,1990-91,1991,1990,Portland Trail Blazers
1,NBA,abdelal01,494000,1991-92,1992,1991,Portland Trail Blazers
2,NBA,abdelal01,500000,1992-93,1993,1992,Boston Celtics
3,NBA,abdelal01,805000,1993-94,1994,1993,Boston Celtics
4,NBA,abdelal01,650000,1994-95,1995,1994,Sacramento Kings

In [19]:
#make a new db with the colums for the table

salary = salary[["player_id", "salary", "season_start", "team"]]
salary.head()

   player_id  salary  season_start                    team
0  abdelal01  395000          1990  Portland Trail Blazers
1  abdelal01  494000          1991  Portland Trail Blazers
2  abdelal01  500000          1992          Boston Celtics
3  abdelal01  805000          1993          Boston Celtics
4  abdelal01  650000          1994        Sacramento Kings

In [20]:
#change the season_start column name to match the table column name

salary = salary.rename(columns={"season_start":"season"})
salary.head()

   player_id  salary  season                    team
0  abdelal01  395000    1990  Portland Trail Blazers
1  abdelal01  494000    1991  Portland Trail Blazers
2  abdelal01  500000    1992          Boston Celtics
3  abdelal01  805000    1993          Boston Celtics
4  abdelal01  650000    1994        Sacramento Kings

# Position Table

In [21]:
#make a new db with columns for the position table

position = players_csv[["_id", "position", "shoots"]]
position.head()

         _id                  position shoots
0  abdelal01             Power Forward  Right
1  abdulza01  Power Forward and Center  Right
2  abdulka01                    Center  Right
3  abdulma02               Point Guard  Right
4  abdulta01            Shooting Guard  Right

In [22]:
#change the name of the id column to match the table

position = position.rename(columns={"_id":"player_id"})
position.head()

   player_id                  position shoots
0  abdelal01             Power Forward  Right
1  abdulza01  Power Forward and Center  Right
2  abdulka01                    Center  Right
3  abdulma02               Point Guard  Right
4  abdulta01            Shooting Guard  Right

# Draft Table

In [23]:
#make a new db with columns for the draft table

draft = players_csv[["_id", "draft_pick", "draft_round", "draft_team", "draft_year"]]
draft.head()

         _id    draft_pick draft_round              draft_team draft_year
0  abdelal01  25th overall   1st round  Portland Trail Blazers       1990
1  abdulza01   5th overall   1st round       Cincinnati Royals       1968
2  abdulka01   1st overall   1st round         Milwaukee Bucks       1969
3  abdulma02   3rd overall   1st round          Denver Nuggets       1990
4  abdulta01  11th overall   1st round        Sacramento Kings       1997

In [24]:
#rename id column to match table column name

draft = draft.rename(columns={"_id":"player_id"})
draft.head()

   player_id    draft_pick draft_round              draft_team draft_year
0  abdelal01  25th overall   1st round  Portland Trail Blazers       1990
1  abdulza01   5th overall   1st round       Cincinnati Royals       1968
2  abdulka01   1st overall   1st round         Milwaukee Bucks       1969
3  abdulma02   3rd overall   1st round          Denver Nuggets       1990
4  abdulta01  11th overall   1st round        Sacramento Kings       1997

# Schools Table

In [25]:
#make a new db with columns for the schools table

schools = players_csv[["_id", "highSchool", "college"]]
schools.head()

,_id,highSchool,college
0,abdelal01,"Bloomfield in Bloomfield, New Jersey",Duke University
1,abdulza01,"John Jay in Brooklyn, New York",Iowa State University
2,abdulka01,"Power Memorial in New York, New York","University of California, Los Angeles"
3,abdulma02,"Gulfport in Gulfport, Mississippi",Louisiana State University
4,abdulta01,"Lycee Aristide Briand in Evreux, France","University of Michigan, San Jose State University"

In [26]:
schools = schools.rename(columns={"_id":"player_id"})
schools.head()

,player_id,highSchool,college
0,abdelal01,"Bloomfield in Bloomfield, New Jersey",Duke University
1,abdulza01,"John Jay in Brooklyn, New York",Iowa State University
2,abdulka01,"Power Memorial in New York, New York","University of California, Los Angeles"
3,abdulma02,"Gulfport in Gulfport, Mississippi",Louisiana State University
4,abdulta01,"Lycee Aristide Briand in Evreux, France","University of Michigan, San Jose State University"

In [27]:
#split colleges into separate columns for players who went to 2

college = schools["college"].str.split(", ", n = 1, expand = True)
college.head()

                            0                          1
0             Duke University                       None
1       Iowa State University                       None
2    University of California                Los Angeles
3  Louisiana State University                       None
4      University of Michigan  San Jose State University

In [28]:
#rename column 0 and add it back to the db

schools["college"] = college[0]

In [29]:
#rename column 1 and add it back to the db

schools["college_2"] = college[1]
schools.head()

,player_id,highSchool,college,college_2
0,abdelal01,"Bloomfield in Bloomfield, New Jersey",Duke University,None
1,abdulza01,"John Jay in Brooklyn, New York",Iowa State University,None
2,abdulka01,"Power Memorial in New York, New York",University of California,Los Angeles
3,abdulma02,"Gulfport in Gulfport, Mississippi",Louisiana State University,None
4,abdulta01,"Lycee Aristide Briand in Evreux, France",University of Michigan,San Jose State University

In [30]:
#split the data in the high school column to extract the high school name

hs = schools["highSchool"].str.split(" in", n = 1, expand = True)
hs.head()

                       0                        1
0             Bloomfield   Bloomfield, New Jersey
1               John Jay       Brooklyn, New York
2         Power Memorial       New York, New York
3               Gulfport    Gulfport, Mississippi
4  Lycee Aristide Briand           Evreux, France

In [31]:
#add the high school name back to the database

schools["high_school"] = hs[0]
schools.head()

,player_id,highSchool,college,college_2,high_school
0,abdelal01,"Bloomfield in Bloomfield, New Jersey",Duke University,None,Bloomfield
1,abdulza01,"John Jay in Brooklyn, New York",Iowa State University,None,John Jay
2,abdulka01,"Power Memorial in New York, New York",University of California,Los Angeles,Power Memorial
3,abdulma02,"Gulfport in Gulfport, Mississippi",Louisiana State University,None,Gulfport
4,abdulta01,"Lycee Aristide Briand in Evreux, France",University of Michigan,San Jose State University,Lycee Aristide Briand

In [32]:
#split the high school city and state/country

hscs = hs[1].str.split(", ", n = 1, expand = True)
hscs.head()

             0            1
0   Bloomfield   New Jersey
1     Brooklyn     New York
2     New York     New York
3     Gulfport  Mississippi
4       Evreux       France

In [33]:
#added high school city and state/country to db

schools['hs_city'] = hscs[0]
schools['hs_state'] = hscs[1]
schools.head()

,player_id,highSchool,college,college_2,high_school,hs_city,hs_state
0,abdelal01,"Bloomfield in Bloomfield, New Jersey",Duke University,None,Bloomfield,Bloomfield,New Jersey
1,abdulza01,"John Jay in Brooklyn, New York",Iowa State University,None,John Jay,Brooklyn,New York
2,abdulka01,"Power Memorial in New York, New York",University of California,Los Angeles,Power Memorial,New York,New York
3,abdulma02,"Gulfport in Gulfport, Mississippi",Louisiana State University,None,Gulfport,Gulfport,Mississippi
4,abdulta01,"Lycee Aristide Briand in Evreux, France",University of Michigan,San Jose State University,Lycee Aristide Briand,Evreux,France

In [34]:
#dropped unneeded columns

schools = schools[["player_id", "high_school", "hs_city", "hs_state", "college", "college_2"]]
schools.head()

,player_id,high_school,hs_city,hs_state,college,college_2
0,abdelal01,Bloomfield,Bloomfield,New Jersey,Duke University,None
1,abdulza01,John Jay,Brooklyn,New York,Iowa State University,None
2,abdulka01,Power Memorial,New York,New York,University of California,Los Angeles
3,abdulma02,Gulfport,Gulfport,Mississippi,Louisiana State University,None
4,abdulta01,Lycee Aristide Briand,Evreux,France,University of Michigan,San Jose State University

In [35]:
#created local connection to postgres

password=config.password
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/NBA4')

In [36]:
#verified that columns are present

inspector = inspect(engine)
inspector.get_table_names()

['demographics', 'salary', 'position', 'draft', 'schools']

In [45]:
#pushed new databases to their corresponding tables

demographics.to_sql(name='demographics', con=engine, if_exists='replace', index=False)
salary.to_sql(name='salary', con=engine, if_exists='replace', index=False)
position.to_sql(name='position', con=engine, if_exists='replace', index=False)
draft.to_sql(name='draft', con=engine, if_exists='replace', index=False)
schools.to_sql(name='schools', con=engine, if_exists='replace', index=False)

In [41]:
sql = text('DROP TABLE IF EXISTS schools;')
result = engine.execute(sql)

In [42]:
sql = text('DROP TABLE IF EXISTS salary;')
result = engine.execute(sql)

In [43]:
sql = text('DROP TABLE IF EXISTS position;')
result = engine.execute(sql)

In [44]:
sql = text('DROP TABLE IF EXISTS draft;')
result = engine.execute(sql)